# Food Ordering and Delivery App - Exploratory Data Analysis

In this notebook, we will do a through EDA of the dataset and try to find key insights by cross referencing different features.

Let us start by importing the required libraries

In [348]:
# import libraries for data manipulation
import numpy as np
import pandas as pd

# import libraries for data visualization
import matplotlib.pyplot as plt
import seaborn as sns

Understanding the structure of the data

In [349]:
# read the CSV file
df_orig = pd.read_csv("food_order.csv")

In [350]:
df = df_orig.copy()

# return the first 5 rows
df.head()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24

In [351]:
print("There are", df.shape[0], "Rows and", df.shape[1], "Columns in the given dataset")

There are 1898 Rows and 9 Columns in the given dataset

In [352]:
# Use info() to print a concise summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1898 entries, 0 to 1897
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   order_id               1898 non-null   int64
 1   customer_id            1898 non-null   int64
 2   restaurant_name        1898 non-null   object
 3   cuisine_type           1898 non-null   object
 4   cost_of_the_order      1898 non-null   float64
 5   day_of_the_week        1898 non-null   object
 6   rating                 1898 non-null   object
 7   food_preparation_time  1898 non-null   int64
 8   delivery_time          1898 non-null   int64
dtypes: float64(1), int64(4), object(4)
memory usage: 133.6+ KB

## Creating unclean data for the purpose of Data Cleaning/Data Transformation

In [388]:
# Copy and store the dataframe in another df to make it unclean
df_dirty = df_orig.copy()

In [389]:
# 1) Null Values in Cells: Set rating column "Not given" to NULLS
df_dirty.replace({"rating":{"Not given":np.nan}}, inplace=True)

In [390]:
# Set some of the "cost_of_the_order" columns as 0
df_dirty.replace({"cost_of_the_order":{29.20:0}}, inplace=True)
len(df_dirty[df_dirty["cost_of_the_order"]==0])

10

In [391]:
# 3) Bad Column Naming: Add a new column called "voucher_used" when "cost_of_the_order" is 0
df_dirty["voucher_used"] = np.where(df_dirty["cost_of_the_order"]==0,True,False)
df_dirty.head()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,voucher_used
0,1477147,337525,Hangawi,Korean,30.75,Weekend,NaN,25,20,False
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,NaN,25,23,False
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,False
3,1477334,106968,Blue Ribbon Fried Chicken,American,0.00,Weekend,3,25,15,True
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,False

In [392]:
# 4) Duplicate Rows: Take some rows and append them back to cause duplicate rows
dup_rows = df_dirty.iloc[[2,12,20,26,34,37,49]]
df_dirty = df_dirty.append(dup_rows, ignore_index=True)

In [393]:
# Count number of duplicate rows
# df_dirty.groupby(df_dirty.columns.tolist(), as_index=False).size()
print("Number of duplicate rows: ", len(df_dirty)-len(df_dirty.drop_duplicates()))

Number of duplicate rows:  7

## Dirty Dataset: Start Here (Hide Above)

In [412]:
df_dirty.head(12)

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,voucher_used
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20,False
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23,False
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,False
3,1477334,106968,Blue Ribbon Fried Chicken,American,0.0,Weekend,3,25,15,True
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,False
5,1477224,147468,Tamarind TriBeCa,Indian,25.22,Weekday,3,20,24,False
6,1477894,157711,The Meatball Shop,Italian,6.07,Weekend,Not given,28,21,False
7,1477859,89574,Barbounia,Mediterranean,5.97,Weekday,3,33,30,False
8,1477174,121706,Anjappar Chettinad,Indian,16.44,Weekday,5,21,26,False
9,1477311,39705,Bukhara Grill,Indian,7.18,Weekday,5,29,26,False
10,1477895,143926,Big Wong Restaurant,Chinese,5.92,Weekday,Not given,34,28,False
11,1478437,221206,Empanada Mama closed,Mexican,8.1,Weekend,5,23,22,False

In [413]:
df_dirty.tail(7)

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,voucher_used
1891,1476981,138586,Shake Shack,American,5.82,Weekend,Not given,22,28,False
1892,1477473,97838,Han Dynasty,Chinese,29.15,Weekend,Not given,29,21,False
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17,False
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19,False
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24,False
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31,False
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24,False

# Data Exploration, Cleaning and Pipelines

### Data Exploration

In [414]:
# Data Exploration: Examining the Values to understand the nature of the data
print("The unique ratings are", df_dirty["rating"].unique())
print("The unique delivery times are", df_dirty["delivery_time"].unique())
print("The unique food preparation times are", df_dirty["food_preparation_time"].unique())

The unique ratings are ['Not given' '5' '3' '4']
The unique delivery times are ['20' '23' '28' '15' '24' '21' '30' '26' '22' '17' '25' '16' '29' '27'
 '18' '31' '32' '19' '33']
The unique food preparation times are ['25' '23' '20' '28' '33' '21' '29' '34' '24' '30' '35' '32' '31' '27'
 '22' '26']

In [415]:
# Optional: Using Python's Regular Expression Module to search for unwanted characters
import re

def find_dirty(string):
    match = re.findall(r'[^0-9a-zA-Z ]', string)
    if match:
        return match
    else:
        return np.NaN

df_counts = pd.DataFrame()
df_counts["dirty"] = df_dirty["restaurant_name"].apply(lambda x: find_dirty(x))
print("The number of cells with unwanted characters is: ", df_counts["dirty"].notnull().sum())

The number of cells with unwanted characters is:  191

In [416]:
# Show the cells with unwanted characters to get a sensing of the characters that need to be removed
dirty_rows = df_counts["dirty"][~df_counts["dirty"].isnull()]
df_dirty.iloc[list(dirty_rows.index.values)]["restaurant_name"]

14                     Lucky's Famous Burgers
40      Chipotle Mexican Grill $1.99 Delivery
47                            Sarabeth's East
54                          Jack's Wife Freda
55                           Mamoun's Falafel
                        ...
1866                       Xi'an Famous Foods
1869                              J. G. Melon
1875                               Amy Ruth's
1893    Chipotle Mexican Grill $1.99 Delivery
1896                        Jack's Wife Freda
Name: restaurant_name, Length: 191, dtype: object

### Data Cleaning

1) Replace NULLs with proper values

In [417]:
# Replace nulls using .fillna method
# FillNa Doc: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html
df_dirty["rating"].fillna("Not given", inplace = True)
df_dirty.head(2)

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,voucher_used
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20,False
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23,False

2) Regular Expression to remove unwanted characters in strings

In [418]:
# Clean up unwanted characters in all Cells using .replace and regex
# Generally we would only want to keep: Alphabets, Numbers and Whitespaces

# Replace Doc: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html
# Regex Tut: https://medium.com/factory-mind/regex-tutorial-a-simple-cheatsheet-by-examples-649dc1c3f285
df_dirty.replace(to_replace=r"[^0-9a-zA-Z\'\$\. ]|^(')", value='', regex=True, inplace=True)

# Apply Doc: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html
df_dirty = df_dirty.apply(lambda x: x.astype(str).str.strip() if isinstance(x, object) else x)

In [419]:
df_dirty.iloc[10]["restaurant_name"]

'Big Wong Restaurant'

In [420]:
df_dirty.iloc[1877]["restaurant_name"]

'wichcraft'

In [421]:
df_dirty.iloc[1896]["restaurant_name"]

"Jack's Wife Freda"

In [422]:
df_dirty.iloc[40]["restaurant_name"]

'Chipotle Mexican Grill $1.99 Delivery'

3) Removing Duplicates from Rows:

In [423]:
# Drop all duplicate rows while maintaining Index order
# DropDuplicates Doc: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html#pandas.DataFrame.drop_duplicates
df_dirty.drop_duplicates(ignore_index=True, inplace=True)
df_dirty.tail()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,voucher_used
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17,False
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19,False
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24,False
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31,False
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24,False

4) Rename boolean columns to follow naming convention

In [424]:
# Rename columns using pandas .rename
# Rename Doc: https://www.geeksforgeeks.org/how-to-rename-columns-in-pandas-dataframe/
df_clean = df_dirty.rename(columns = {'voucher_used':'is_voucher_used'})
df_clean.head()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,is_voucher_used
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20,False
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23,False
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,False
3,1477334,106968,Blue Ribbon Fried Chicken,American,0.0,Weekend,3,25,15,True
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,False

# Data Analysis and Visualization

# Storytelling with Data